[
  "Ready, set, hood.",
  "Welcome to the Dynasty Nerds Fantasy Football Podcast, where we discuss Dynasty Strategy, rankings, and all things NFL.",
  "So, get ready to geek out on fantasy football with your host, Rich Dodson, and welcome to Dinosaur Fantasy Football Podcast.",
  "I'm Rich Dodson.",
  "He's Matt O'Hara.",
  "Hey.",
  "Hey.",
  "He's G Price.",
  "How's it going?",
  "And we're back to cover up the loose ends with the tight ends.",
  "That's right.",
  "We're talking top 12 tight ends.",
  "Not dynasty tight ends, but like how we think they're going to finish in the 2025 season.",
  "And you know, we all know the top guys.",
  "We all know how it's probably I feel like our top tier is going to be pretty similar.",
  "Um, no surprise, but we I'd be shocked if our top three guys weren't the same.",
  "The same three.",
  "I would be very surprised as well.",
  "Maybe maybe slightly different order, but maybe slightly different order.",
  "We're going to find out her soon.",
  "Um, and you know the key is like can we find out like who's going to finish as tight end four through seven and that's like the difference maker between your league mates, right?",
  "Because we already know the top three guys are going to give you an edge like nobody else has.",
  "But if you can have a guy that's like finished four through seven and is a little bit closer to tight end three, then you have now an edge over your rest lemates because once you get a tight end eight through 16, almost like wide receiver nine through wide receiver 15 on a points per game basis are pretty similar.",
  "So, before we dive in here, uh, this is literally the last chance you're going to have until kickoff next week.",
  "I think we can probably promote this next week's shows as well.",
  "Promo code nerds 30.",
  "What does it give you?",
  "It gives you 30% off of the Nerd Herd.",
  "That's right, the Nerd Herd 30% off.",
  "It's a big massive discount we're giving to get everybody ready for the 2025 season and belong and and beyond.",
  "Because in Dynasty, when I say the season's upon us, it isn't just the NFL and fantasy season.",
  "This is the start of the 2025 season for us.",
  "I mean, essentially, it really started back in January essentially because that's when we started doing the rookie prospects to get ready for this season, but to get ready for the 2026 season as well.",
  "This is where Dynasters is also going to help you.",
  "We're going to have the inseason tools to help you.",
  "Right now we have um the lineup optimizer in the Dynasty GM and our lineup optimizer, not to brag or anything, did better than Yahoo, did better than ESPN, and did better than Sleeper on our projections.",
  "They all um they're they're the lineup optimizer suggestions were better than everybody else's.",
  "So, what that what the app's going to do, it's going to go in there, it's going to read your starting lineup for you and tell you what changes you should make.",
  "And last year, it was right way more than it was wrong.",
  "some cool little things that you never think of too, like getting getting the uh um the best player into your flex and all that kind of stuff.",
  "Yeah, absolutely.",
  "That's right.",
  "It doesn't our app doesn't tell you Yeah.",
  "like, \"Oh, switch this receiver to this receiver.\"",
  "It say, \"Hey, move this receiver to your flex and then move this receiver in your wide receiver three.\"",
  "I didn't even think about so I forgot it does that because one of because when they play and things like that.",
  "Yep.",
  "So that's that's an inseason tool like a reddraft tool that the Dynasty GM does for you.",
  "It gives you access to to mock drafts.",
  "gives you the league analyzer, your player shares, the trade browser, which is going to show you real trades in real time made throughout thousands and thousands of fantasy leagues that are real trades and dynasty trades that so much more.",
  "And then when you get to the offseason, Dynasty Nerds Film Room, the nerd score, the extra content, the extra podcast, all for 30% off.",
  "Use the promo code Nerd 30.",
  "It'll be the best investment you ever make for your Dynasty team.",
  "So Nerds30, get in.",
  "It expires at kickoff next Thursday when the Eagles are playing.",
  "Who the Eagles play?",
  "Cowboys.",
  "The Cowboys.",
  "How about that?",
  "Great start to the season.",
  "Love it.",
  "Huge opener, right?",
  "Oh, I can't wait.",
  "It's going to be gaping.",
  "Anyways, so be gaping.",
  "Top 12 tight ends.",
  "Garrett, you have been a salty about this.",
  "Like you're on a paddle board in the ocean because you like it.",
  "Gargle gargle.",
  "Where are we uh approaching the tight ends?",
  "Let's uh let's go three at a time.",
  "Let's go three at a time this time.",
  "I feel like that makes more sense.",
  "Okay.",
  "In order in order how I think they finish top three.",
  "Yep.",
  "Which is again either way, but you could mix them up, but I I do have a preference.",
  "I really wanted to put George KD as my tight end.",
  "I wanted to I didn't, but I I wanted to, but then I was like, dude, Jacobe Myers is always being already being whiny about his time over there.",
  "Like, dude, Brock Bowers is again all the targets.",
  "Number one, all the targets.",
  "So, Brock Bower, he was tight end one last year, but on points per game basis, George KD was tight end one.",
  "True.",
  "Just mind you that.",
  "So Brock Bowers one, George KD two, Trey McBride three.",
  "I just I went chalky chalk.",
  "I went Brock B Trey McBride McBride then KD same as last year's um finish.",
  "But I mean, you know, it's it is what it is.",
  "These guys, you can't go wrong with either one of these.",
  "I ended up going Bower's KD McBride is on the same page.",
  "Yeah, we're on the same page.",
  "Here's here's my one beef with this right now.",
  "Where's the beef?",
  "Uh because I just did a a a friendly reddraft league the other day and I was looking at how all these things Did you destroy everyone?",
  "Of course.",
  "And it wasn't it wasn't friendly.",
  "Yeah, it was less than cordial.",
  "Uh but I was looking at the ADP of where these guys were going and it shows it right here as well.",
  "Brock Bowers goes off the board at 17.",
  "Yeah, understandable.",
  "Sure.",
  "Trey McBride 27.",
  "Uhhuh.",
  "10 picks later, George KD 38.",
  "So even though he's the third tight end off the board, way later.",
  "That's the value.",
  "100%.",
  "That's the value.",
  "Every reddraft league I've done so far, every best ball draft I've done, I let everybody jump on Brock I wait for Brock Bowers to go.",
  "Trey Mc Bry goes like real quick after and I make sure I get George KD because that is where the value is.",
  "instead of taking Brock Bowowers and, you know, missing out on that elite other running back or top tier receiver, I'm like, dude, I'm just gonna get George KD.",
  "Let me ask you this, though.",
  "You're sitting there at the last pick of the draft.",
  "What do you do?",
  "Because you get two picks there and then you don't pick until 36.",
  "What if somebody scoops you and then you're out?",
  "Then then I go to my my strategy B, okay, which is just suck and be mean tight end.",
  "Okay.",
  "No, there's two or three tight ends towards the end that I really like.",
  "I have a very bold strategy for a guy who's my tight end for by the way.",
  "I wonder if we have the same guy.",
  "Is he a local yokal?",
  "He is.",
  "He is.",
  "Me, too.",
  "Yeah.",
  "The same strategy.",
  "We've been talking about him a lot, so it doesn't surprise me.",
  "Yeah.",
  "So, like if I miss out on George KD to end round three, I have a very clear-cut draw who a guy who won't even go as tight end four because Sam Laapora is going to usually go tight end four there.",
  "Hinson, but like I have a guy that is I am zeroed in on that I think will finish um in that tier.",
  "And I' I've said on our uh nerd herd show like has a chance if there's one tight end that could break the mold of these three guys.",
  "This is the guy who I believe it is and it's my tight end four, David and Jooku.",
  "Okay.",
  "That I mean yeah.",
  "Do you also have him as I have him as tight end four as well.",
  "I have got him at tight end five I'm sure for very similar reasons.",
  "Um and this this I literally did a video like two months ago of like the the the surprise players that could finish number one overall and and David and Jooku was my guy for that.",
  "The easiest thing to do is just look at what he did with Joe Flacco before.",
  "That's it, man.",
  "That's the easiest thing to do.",
  "Those two guys are like peanut butter and jelly.",
  "Yeah.",
  "Did you see all the videos of them in golf carts together having a good time?",
  "Like, dude, he's going to be force-fed targets.",
  "Like, it I like Judy as well.",
  "Yeah.",
  "But the the guy to own for me in this offense, if I have to pick one, is absolutely David 100%.",
  "That's I'm a little bit lower on Judy than probably like I think than Rich because I think it's going to be the Injoku show.",
  "Y it's going to be they're going to be running the heck out of the ball.",
  "I haven't seen the type of connection.",
  "You know, obviously we only saw one preseason kind of series with those two guys on the field and it was a a misfire on the target.",
  "Um as far as uh Judy and and Flaco, but I I think I think Injoku and him have proven over time that you know obviously they have a really really strong connection.",
  "And even any quarterback not named Deshun Watson to start and finish a game last year, he averaged over 15 points a game.",
  "Yeah.",
  "So, he's still putting up borderline number one overall tight end numbers just with any random quarterback last year.",
  "Jameus Winston, uh, Thomas, uh, I even forget his name now.",
  "Thompson Robinson, Dorian Thompson Robinson, the worst quarterback I've ever seen play in.",
  "Yeah, terrible.",
  "Uh, like it didn't didn't matter who it was.",
  "He produced.",
  "He produced.",
  "So, you have that and you get Joe Flaccco back.",
  "Like I I think he's a smash value because his ADP right now in reddraft is tight end ninth off the board and he's going in the 80s overall.",
  "So in your traditional 10-man league that's eighth round like you're getting him in the eighth round.",
  "So I think that's just crazy good value.",
  "It's why I'm willing to gamble on the KD because if I miss out I'm totally comfortable getting in Jooku.",
  "He mentioned and in total last year he averaged I think about 13 point 13 13.5 points per game in PPR leagues.",
  "He missed five games last year, still finishes tight end 10 uh overall.",
  "And I I like Injoku.",
  "Obviously, we're all gushing about him right now.",
  "Do you guys have any concern that hey, they got rid of Kenny Kenny Picket?",
  "If something happens, they lose a few games, they're going to start turning to these rookies and then who the hell knows what we got out of a guy like Injoku.",
  "No, I think Garrett, like even mentioned, like the way he's the fact he was able to produce even all the other turds back then.",
  "I think Dylan Gabriel's a better quarterback than all those guys.",
  "And I I still think Andoku fits the mold of what we're looking for for the guys that have the chance to break in here.",
  "It's a guy who's gonna be the number two target in their offense.",
  "It's only you be the first or second target in their offense.",
  "Obviously, uh you have Brock Bower is number one target.",
  "Trey McBride, you can argue is number one target with Kyler Murray in that offense.",
  "George KD, if he's not number one, he's 1B, right?",
  "I think the same thing in Jooku falls into the same line as if he's not 1A, he is 1B.",
  "So that's what's going to propel him.",
  "I mean last year he saw the third most targets per game uh close to nine as it was.",
  "So I think with the quarterback play he's a get from Joe Flacco.",
  "We mentioned reported he's already got those guys are like two piece in the pod like you mentioned.",
  "This is a player who's gotten better every single year of his career.",
  "He's entering a contract year as well and he's entering 28 which is a prime year for tight ends.",
  "So he is just ready to take another step forward.",
  "First a question a and then I'm gonna go to one.",
  "Uh um a Dylan Gabriel obviously kind of earned the backup role there after this last performance um in everyone's eyes here.",
  "He can operate this offense.",
  "I I think personally there probably wouldn't be I mean there's going to be a drop off from Joe Flacco to anybody else on the roster, but I think he can operate the offense and and kind of support a guy like David Jok.",
  "So, I feel good about him being there and kind of being the number two guy.",
  "And number number one, uh, I can't remember what the other question was.",
  "Just let's move on.",
  "I threw myself off with the A in one.",
  "I think if you bring in a guy like Dylan Gabriel, they're going to try and keep things short and sweet for him to start, right?",
  "Like a lot of quick things like in the flat over the I remembered one.",
  "Harold Fannon looked good in this past few seasons and and with Injoku coming into a contract year, is there any thought that he chips away and and starts kind of getting a bigger piece of that pie?",
  "I think they're such different players that if they if he does start to see more snaps, it's because they're running two or two tight end likely.",
  "He's getting Isa like I think that's the case.",
  "I don't think it's at the expense of David and Jooku.",
  "And they even talked about uh I think it was the tight end's coach that came out and said like, \"Yes, they're both tight ends, but they are extremely different players in the way that they play the game, and we want to utilize both of those skill sets.",
  "They're gonna listen, the Browns are going to run a lot of 12 personnel regardless.\"",
  "So, yeah.",
  "So, I have David and Jooku at four.",
  "Um Garrett, you have him at four.",
  "Matt, you said I had him at five.",
  "So, who do you have at four?",
  "I got the Joker, man.",
  "Evan Ingram.",
  "That's what I have at five.",
  "Yeah.",
  "So, I think I think all of us have him at five, too.",
  "I don't have him at five.",
  "I I wanted to get him there.",
  "I have him at eight.",
  "So, I have him a little bit lower.",
  "All right.",
  "Okay.",
  "But you have him at four, right?",
  "I have I'm at four.",
  "And obviously, it's on the back of, you know, all the talk this whole offseason about Tron Peyton wanting to get a Joker and then him going out and kind of finding his guy, going out and saying, \"Hey, this is this is the guy that I want.\"",
  "Him and R.J. Harvey, which I think R.J. Harvey is going to have a role this year.",
  "I don't know that it's going to be as the Joker yet.",
  "You know, I think that's kind of one of those things that he'll have to grow into if he if he does become the long term.",
  "And RJ Harvey's not even going to play on third downs.",
  "Like, you know, it's Yeah, it sounds like his pass blocking is a big concern at this point.",
  "So, he'll really need to grow in order to become that kind of guy.",
  "JK Dobbins is reported he's the starter.",
  "Okay.",
  "As it's reported right now.",
  "All right.",
  "So, I mean, we all know that, you know, JK Dobbins is a talented guy.",
  "Can can catch some passes.",
  "I don't think he falls into the Joker kind of role as much as he is kind of just like an every down type of guy at this point in his career after all the injuries.",
  "So Evan Ingram is left, you know, as the guy that they're going to kind of use as this moving chest piece.",
  "And I think Shawn Peyton has proven in the past that he he really likes to target the tight end and really likes to get those guys involved.",
  "So that's why I got him at number four.",
  "For what it's worth, I I kind of have a tier for me.",
  "David and Jooku is kind of in his own tier after George KD and then five through nine are who's the last guy left like whoever is has the lowest ADP the guy that's available then I'll take them if I don't if I'm not able to get five through seven.",
  "So, I mean I mean I don't have I can't find Evan Ingram right here, but we're like one year removed from him being bananas and I could",
  "and",
  "that's why that's why I was gonna go off of Matt like so when you look at tight Evan Ingram what he can do when the target shares there and I'm agree with you.",
  "I think he does play that joker role.",
  "I think Shawn Payne does utilize him.",
  "I think he fits the mold of being the number one or the number two target in this offense and when he did that in Jacksonville we really saw him excel in 2022.",
  "43 targets 114 catches.",
  "Crazy amount of targets in 2022.",
  "He ended up being tight end five in PPR.",
  "And then when he got more acclimated in that offense, we saw more targets.",
  "He in 2023, he was tight end two overall in PPR.",
  "So, this is a tight end that we can that we've seen do it when the target share is there.",
  "I know last year he's seen about five uh receptions per game.",
  "I could see that go up to about about eight like like eight per game.",
  "So, for me, I'm with you.",
  "It's why I have him at five.",
  "I I couldn't get ahead of Enjoku because Enjoku's to me is a little bit more clear-cut.",
  "We want to see Evan Ingram in that role and I do predict him to be there but it's not 100% for me and with addition of having Courtland Sun.",
  "I think if if I knew that Flaco was going to be there and be the starter all year round all year, I would say for sure and David and Jooku over Evan Ingram.",
  "I just I think the path that the Browns are on in my opinion is hey we're going to start the year with Joe Flacco if things go south and they have a very hard schedule kind of upfront.",
  "Yeah.",
  "If this thing starts going off the rails we have to do our best to see what we have in this third round pick this fifth round pick.",
  "So next year we have the most informed decision possible.",
  "Do we need to go out and make a move at quarterback?",
  "And I think that is I think especially with with the trading away of Kenny Picket that signals that that path even more to me.",
  "I I've said that for a while now.",
  "I think um I think this schedule starts so tough you can't throw a rookie quarterback in there.",
  "You will just break them.",
  "I think Flacco does I think you're giving Flaco the start all the way through the London game which is the Vikings.",
  "Okay.",
  "Which I think is week six I think somewhere around there.",
  "I'll be there.",
  "Um I think after that if we're like one and five, two and four.",
  "Um maybe they're two and four like we've been played close games.",
  "They give another week maybe it gets to the buy which I think is two weeks later.",
  "But I think the Vikings game is where like that's where we're going to start to pivot.",
  "And then you're right.",
  "I think they're going to want to see what they have in Dylan Gabriel because like if they they spend a third round pick on him.",
  "I I've been kind of hammering this all along, right?",
  "Like everybody's been I've been saying on the show like during rookie stuff like people are drafting Shadur Sanders way ahead of Dylan Gabriel but like the Browns love Dylan Gabriel and they've done that throughout camp they've done it through um this point they just named today Dylan Gabriel the number two quarterback.",
  "I mean I said it when they drafted him that dude can run the offense right now and he looks like he can run the offense right now.",
  "He looks good.",
  "I mean he for somebody who I didn't over love say he looked good in this offense.",
  "He doesn't push the ball down the field as much as you'd like, but I he knows how to hit that back foot and find a guy and he processes well and gets the ball out quickly.",
  "And that being said, I still think the Browns starting quarterback is playing college football this year and they're going to use they Browns have acquired a lot of draft capital for 2026.",
  "10 picks next year.",
  "Yeah.",
  "And two for like they're going to go get a quarterback.",
  "It's a quarterback heavy class.",
  "So, yeah.",
  "So, we'll see.",
  "Um Evan Ingram, I have him at five.",
  "Um, you have him, you have him and Jookus flip-flopped, right?",
  "So, Garrett, who is your five?",
  "So, my five, I actually went back to Old Faithful.",
  "Uh, I put Travis Kelce there.",
  "Uh, I think the thoughts of his demise were overblown last year.",
  "He was tight end five last year.",
  "Like, he was still a very good athlet.",
  "Yes, he wasn't the elite blue chip guy that he used to be, the the standalone guy.",
  "Still a very good guy.",
  "And it looks like we are going to be getting some mime time from Rasheed Rice.",
  "So with that, I think he's still going to have enough volume and I think he's going to be good enough to still be right in that range.",
  "I'm at six.",
  "So I'm I'm with you.",
  "Can I get some credit here?",
  "Um I said on this podcast a month ago, I think I broke into the world that he was about the engagement.",
  "He's going to be engaged.",
  "So he got engaged today, but I did I not say this podcast a month ago.",
  "My birdie had told me that Travis and Taylor would be getting engaged soon.",
  "Yeah, you did say that.",
  "Did I not say that?",
  "And here we are just a month later in Aaron engage.",
  "So tech I mean I was the one breaking news.",
  "I was the one that not breaking news.",
  "I had I had inside info on that just by the way.",
  "Um but yeah you have we are the official Taylor Swift podcast obviously.",
  "Come on join my podcast.",
  "Taylor I to be honest with you everything I've heard about her is like first of all my wife wanted to watch that podcast when she was on New Heights.",
  "I thought she came out absolutely fantastic.",
  "She looked fantastic on there.",
  "Again, I have I know somebody who's best friend.",
  "Yeah.",
  "Like, so like everything I have heard about her is that she is awesome.",
  "She's the most down to earth per person.",
  "She jokes around, has a good time, knows how to give good time.",
  "You would never know like by just hanging out with her like she's one of the biggest stars in the world.",
  "So like I and that my wife is like, \"Oh, I really enjoy that.",
  "She came off really well.\"",
  "I was like, \"Yeah, she came off exactly how I heard she is.\"",
  "Like she's really just a great person.",
  "So I mean that's great to hear because that could go, you know, all sorts of crazy ways when you're making that kind of money.",
  "So of course, you know, if you're the biggest star in the world, what are you going to",
  "You're gonna marry a Cleveland boy.",
  "Adele did the same thing.",
  "So, come on.",
  "Get hip.",
  "Get hip out there.",
  "Us people from Cleveland are just, you know, just slightly better.",
  "Slightly better.",
  "I mean, got bone thugs in harmony.",
  "You can't you can't mess with that.",
  "Yeah.",
  "So, um you have Travis Kelce at five.",
  "I actually have not at 10.",
  "Okay.",
  "Um it's you we saw last year like he he approached uh uh career lows in what like his touchdowns, his yards after the catch, um his yards per route run, his total receiving yards.",
  "And what concerns me still 823 yards now.",
  "Say his lows are still really good.",
  "And listen, I get like like Garrett said, he still finished as tight end like five overall.",
  "So like he was still legit.",
  "My concern is now yes, he is a year older.",
  "It's it's the Rashid Rice because where Rashid Rice and he's he missed a lot of time last year.",
  "Where Rasheed Rice wins like he's not like a take the top off defense like he wins in the middle of field, right?",
  "Like the short crossing routes are his bread and butter.",
  "So, I think he takes away from Kelsey is what it is.",
  "So, I still have a tight end 10.",
  "If you finished higher, not surprised because like you said, my tight end from tight end eight down.",
  "Yeah.",
  "Whatever.",
  "You know, like I haven't finished, but like we're splitting we're spinning micro hairs.",
  "Right.",
  "Right.",
  "So, for me, it's just I think the Rasheed Rice effect is what's going to take away from Kelsey just enough because it is so close.",
  "Just kind of we talked about before the light tight ends or the receivers.",
  "It's just so close.",
  "Any another slight down tick from his production like we saw last year where everything was down, right?",
  "Um it just moves him from tight end five to tight end 10 because it's it's that close on a point per game basis.",
  "Where do you have tight end uh Travis Kelce Matt?",
  "Six.",
  "Oh, so pretty high.",
  "So I'm the lowest.",
  "You're the lowest.",
  "Yeah, I already mentioned that.",
  "I am at six there.",
  "It's just so like",
  "So I had So who's your six then?",
  "Because we have our Oh, yeah.",
  "So you have I think my Evan Ingram was or no?",
  "Oh yeah, Evan Ingram four Jou five and then Travis G.",
  "So who did you have?",
  "I have TJ Hawinson at six.",
  "I have T.J. Hawinson at six as well.",
  "Okay.",
  "Where do you have Hawinson?",
  "Um 12.",
  "Oh wow.",
  "Way too low for me.",
  "Um why why why so low?",
  "Is it the nerves about JJ McCarthy first year or what what's what's causing that trepidation?",
  "I mean yeah.",
  "Um, no, I don't have a lot of con I don't have a lot of conviction about about TJ Hawinson here at 12.",
  "Um, he was tight end 12 on the year last year.",
  "Only only played 10 games.",
  "He he probably is probably a little bit low for me right now that we're discussing things and talking about him on a podcast uh and not writing them down, which is which is very very easy to do.",
  "Um, listen, I I do think obviously especially with what's his name um being Addison.",
  "Addison being uh gone suspended for a couple games.",
  "Was it three games?",
  "Four.",
  "Is it four?",
  "Yeah.",
  "Why?",
  "It's why I w I thought about putting Hockson higher.",
  "For some reason, in my head, I only had it down as two.",
  "So, that's crazy.",
  "Well, you said three, I say four, you say two.",
  "I believe it's four.",
  "You You're probably correct.",
  "I I I didn't say that with a lot of conviction, but for some reason, in my mind, it was only two.",
  "Yeah.",
  "So, I mean, we could see we could obviously see Hawinson being much higher than where I have him.",
  "And and I think, you know, it was just more of a factor of getting other guys in above him and kind of at the end going, I need to get um T.J. Hawinson into this top 12.",
  "Where does he fit?",
  "Um and I I just felt really good about my other guys.",
  "So that's why Hawinson ended up 12.",
  "I think it's",
  "Yeah, it's three games.",
  "It's three games.",
  "Okay.",
  "So, who was right there?",
  "You.",
  "All right.",
  "Look at this guy.",
  "You mentioned, Matt, he was tight end 12 last year.",
  "Yeah.",
  "And that was He was on a points per game basis.",
  "On a points per game basis.",
  "And what's nice is like he missed a lot of time last year.",
  "He he didn't come in until week nine.",
  "He played in 10 games.",
  "Yeah.",
  "So he only played in 10 games.",
  "Uh come off the ACL and MCL surgery.",
  "So that's going to take a little bit time to come back from.",
  "And even when he came back, I mean he wasn't like overly fantastic.",
  "Um weeks nine through 17 though, which is where I have him, he was tight end 10 overall.",
  "Okay.",
  "So and and that was that wasn't anything.",
  "You know, the year before he had 95 catches, 960 yards.",
  "And the question is, you know, can he come back to where he was?",
  "And this is somebody when you look back at 2022 tight end two overall, 2023 tight end four overall.",
  "And I think he's extremely talented tight end who at one point had my dynasty tight end won overall because how much I loved him.",
  "I think that Jordan missing a couple games is enough to really propel him.",
  "Now that he's more than a full year removed from his injury, the fact that he's gonna be able to slide in as a number two target in this offense, um I think it'll kind of help propel him, build that rapport, JJ McCarthy, be again, we always talk about these rookie quarterbacks, like always one of their safety nets.",
  "It's usually the tight end.",
  "I think Hawinson kind of felt um find himself in that position.",
  "I think Kevin Okonnell could trust Hawinson enough to be JJ safety enough as well on top of having a guy like Justin Jefferson.",
  "So for me having tight end six and Garrett you as well I'm sure you feel the same way is he's just too talented for me um not to not to come up this high but like I said when I get to tight end 678 so my it goes to me it goes Hawinson Leaporta and Tucker Craft for me and I could easily see all three of those guys being tight end six tight end seven and honestly they finish as like tight end five you know like Hawinson's talented enough like he could finish as tight end four and it wouldn't he could outproduce injoku I'm with you.",
  "I have him in my own tier, but like if he finishes tight end five, um if Leaporta was tight end five, if Tucker Craft was tight end five, that does not shock me.",
  "So even though I have Hot Tockinson at six, I'm with you in the tier group.",
  "Five through like eight to me are pretty close.",
  "I like I almost want to put Evan Ingram in his own tier because I'm with you Matt like how I believe he's going to play that Joker role.",
  "Once I know that for sure, he's locked in there.",
  "And that's why I said like six through eight I feel more comfortable interchanging.",
  "But at the same time, those guys could easily jump up for me.",
  "So I do like you have Hawinson at six as well.",
  "I have Hawinson at six as well.",
  "And yeah, I echo a lot of the same things you do.",
  "It just comes down to the to the player himself.",
  "Um he is just such a talented player.",
  "This offense is just friendly for fantasy football points.",
  "Uh so I I I see him in a very positive light.",
  "Uh and then for me, I have at seven, I have Sam Laaporta.",
  "Yep.",
  "And then which is So do I. pretty low actually for well for ADP I'm saying uh overall ADP he's the fourth tight end off the board and when you look at Sam Laora he's the 51st guy off the board then",
  "when you get into a lot of the guys that we're talking about Evan Ingram David and Jooku Tucker Craft Evan Ingram's 80 and Jooku is 82",
  "Tucker Craft's 108 um so I mean he's significantly ahead of those guys so for me Sam Leaporta",
  "This is not a knock on him as a player.",
  "I think he's a very, very talented player.",
  "But once again, if this offense just takes a 5% step back, 10% step back.",
  "And then if Jameson Williams is actually more involved and takes some of that away, like there's just a lot of little things.",
  "They don't have to be huge things, just little things that could pull him back that could all go the wrong way, basically.",
  "And Leaporta was eight last year.",
  "Yeah.",
  "Tighten eight.",
  "So, I mean, I came on a show six months ago and I brought this up and I said, \"Man, one of my biggest sells right now and tight end premium or in fantasy right now is Sam Laaporta.\"",
  "We talked about that a lot on roster rescue as well.",
  "And I said, this has nothing to do with Sam Laaporta.",
  "I think he's a super talented tight end.",
  "I was like, my point is he finishes tight end eight this year.",
  "I feel going forward Sam Laaporta, which is again a very solid asset to own, is gonna live in tight end six to eight range consistently.",
  "Um, and the reason why is I still have some my notes back here from early like six months ago and it says what happened to his targets per game.",
  "It went from seven to five.",
  "So he lost two targets per game because Jameson Williams took a big step up.",
  "What did we used to talk about with KD?",
  "It was like well KD can always he can perform if these other if one of these If one of these two other guys goes down, and it's a very similar thing argument you can make for Sam Laora.",
  "If he if one of those guys goes down and Sam Laora all of a sudden gets more of the target share because those naturally they're just out of the offense, then yeah, he can bump way the heck up.",
  "He's got the talent to do it.",
  "It's just there's only one football and there's only so many targets to go around per year.",
  "Yeah.",
  "And we saw Jameson Williams clearly establish himself as a number two target at offense.",
  "And we've made and that was my point about selling him too like hey man like he's now the number three target in that offense and you can't be an elite tight end if that's how you're going to operate.",
  "It's just not pos it's literally not possible for you to break that tier.",
  "So like my suggestion was like, \"Hey, move off of Leaporta for like even like a guy like in Jooku extender plus, right?",
  "Because you could probably get David and Jooku plus a first uh this year.\"",
  "And just imagine if you got you sold David Sam Laaporta for David and Jooku in like 111 and now you can sit there either with Sam Laaporta and like Caleb Johnson.",
  "Sam Sam or I'm sorry um David and Jook.",
  "Yeah, David and Jooku and Caleb Johnson, RJ Harvey, Colston Love, another tight end, a Jackson Dart.",
  "like and I feel much more comfortable with that combination because I'm with you Matt like as it's going to take another receiver to leave that for him to get into that situation and yes they picked up Jameson Williams fifthear option but with how good Isaac Tessa has looked in this offense they spent a third round pick on him there's nothing to believe that if for some reason Jameson Williams leaves that Tesla is not going to literally slide into that Jameson Williams role so those concerns for me is again it's just about value verse production and I love Sam Leaporta I really do I think He's an amazing talent.",
  "It just comes down to the situation.",
  "Exactly.",
  "I feel like Dvonte Smith, like I said last year, like I love Devonte Smith.",
  "I love his talent.",
  "It's just where the target shares where the opportunities, right?",
  "It's a that it all comes down to system and why we love again Alvin Kamaro so much because of the system he plays and how he plays.",
  "It's not as do the players.",
  "So, is there a path for Leapora to join those elite guys again?",
  "Definitely as like some of these other guys start to age out.",
  "100%.",
  "But as things stand now, Leaporta to me fits right where he finished last year.",
  "tight end seven, tight end eight.",
  "Like I'd almost rather chase the upside of a guy like Tucker Craft plus and I get a significant plus than having Sam Leaporta.",
  "Now, can I settle with Sam Leaport in Dynasty?",
  "Oh, I'm very happy to have him because if I have Titan 7, Titan 8, Tight end six, year in year out, like I feel very comfortable, but again, I'm trying to build the best roster possible to score the highest points, not settle, right?",
  "No, it makes perfect sense.",
  "Rich, why don't you tell us about our friends over at FFPC?",
  "Yeah, my FFPC.",
  "This is I  think Garrett said last show this is the last uh time we're promote them until the uh season comes back where we start talking orphans here and come January.",
  "Uh so this is your last chance to go out there and check them out.",
  "I don't even know if there isn't that much time to join a Dynasty League at this point.",
  "But go find out",
  ".",
  "But go check them out.",
  "Use the promo code Nerd get $25 off.",
  "And just to let everybody know what they stand for as we get ready for the season case time you're listening.",
  "If you can get in, great.",
  "If not, we'll have some good opportunities for you to join your orphans.",
  "is, you know, this is a place where you can go and play high stakes dynasty.",
  "You can join leagues up to $2,500.",
  "You can join leagues for $75.",
  "You can join standard, PPR, Superflex, try superflex.",
  "So many different options they give you.",
  "And what they the number one thing they offer you is security.",
  "This is a place where no league has ever folded, no matter what.",
  "So when you get in one of these leagues, you feel very comfortable about building for the future, blowing it up because you don't want to play in a thousand league, a $2,000 league, and you're like, \"This is it.",
  "I'm blowing everything up, and now I'm taking the da device.",
  "I have 827 first.",
  "I am going to dominate 2027.\"",
  "Um, and mind you, I saw a great tweet from Matt Miller, the ESPN draft analyst, uh, yesterday.",
  "It said, \"Man, if I play Dynasty, I'd be loading up on 27 picks.",
  "That looks like a one of a kind, dude.",
  "I've been telling people.\"",
  "And I was like, \"Dude, Matt, Matt, we are Dynasty experts.",
  "We've been saying this for nine months.",
  "So, welcome to the club, buddy.\"",
  "And you're NFL draft analyst.",
  "Anyways, my FFPC if that league folds all of a sudden because like too many people bounce because nobody has their first like you just spent 2,000 $4,000 for literally nothing, right?",
  "Like there's no fun in that.",
  "So, check them out.",
  "My fpc.com promo code nerds.",
  "Yeah.",
  "And fast draft, man.",
  "Things are just getting going here.",
  "You can enter that rabbit tournament and I've I have a lot of entries in it.",
  "To be honest, I've thoroughly enjoyed uh the product there at Fast Draft.",
  "You you can use promo code nerds.",
  "They're going to match that deposit.",
  "If it's 10 bucks, now it's 20.",
  "If it's 50 bucks, now it's $100.",
  "They'll match it all the way up to $50.",
  "So, head over there, Fast Draft.",
  "Use promo code nerds.",
  "Best of all, you're also going to get a free year of everything we do.",
  "Extra podcast, GM tool, film room, everything.",
  "everything we do, you can get an absolute free year.",
  "It's It's the best offer in Dynasty right now.",
  "So, use promo code nerds at fastdraft, win a bunch of money there, and get free stuff from us.",
  "Hell yeah.",
  "So, Matt, how about you just um we went through six, right, for you?",
  "",
  "Yep.",
  "I went I went 678.",
  "Uh before we give because I know we're gonna talk about Tucker Craft.",
  "You went to six.",
  "I I I did mention my 67.",
  "How about this?",
  "How about you give me six through 12?",
  "Okay.",
  "and then we'll all go through our sixth through 12 and then we'll kind of go into some of these guys.",
  "Can we do seven through 12 or six?",
  "Do you want six through 12?",
  "Just remind a little recap on that.",
  "We're not going to talk about the six player but just kind of so six through 12 TJ Hawinson then Sam Leaporta, Evan Ingram, Tucker Craft at nine.",
  "At 10 I have Mark Andrews.",
  "At 11 I have Hunter Henry.",
  "And at 12 I have Kyle Pittz.",
  "I thought about getting Hunter Henry in there.",
  "I you know it's a weird it's a weird range down there and I was like it is very weird and I went a little weird there too.",
  "Did you I was like right at that same who's Mr. like steady that like oh he's tight end 12 again like it could easily be love at 12 but anyways who's your sixth through 12.",
  "All right 6 through 12 I went uh Travis Kelce Sam Leaporta at seven at eight I went Colston Loveland.",
  "Whoa.",
  "Yeah.",
  "We were talking ADP wise like who's the highest on Loveland?",
  "Matt was way higher.",
  "I was like I told you you loved him.",
  "I love him.",
  "I was like, uh, number nine, Tucker Craft.",
  "Now, now we see why George KD is below him in our in our GM tool.",
  "That might just be a function of We'll talk about that later.",
  "Um, Mark 10 10 Mark Andrews, 11 Zack Z.",
  "That's where I went a little crazy.",
  "Not a bad I had Zack Z written in.",
  "Yeah.",
  "And I had to take him out for my 11 guy because there's no way I was not going to put my 12th guy in.",
  "Um, I know who that is.",
  "But I had Zack Z written in.",
  "Okay.",
  "All right.",
  "So, to be fair, your 12th guy is my 13th.",
  "So, I I almost got him in.",
  "Um, so did I.",
  "I wanted to.",
  "If it wasn't for Debo Samuel, Zacks would have been higher.",
  "That That's been on my mind.",
  "But I I I still think the Debo I I still think I still think he gets enough.",
  "I think I think where Zack Z gets there is.",
  "It's not on the amount of catches and yards he gets.",
  "I think it's the touchdowns is what I think he's I think you see double digit touchdowns this year.",
  "So, my six on is I have T.J. Hawinson at six, Sam Leaporta at seven, Tucker Craft at eight, Tyler War at nine.",
  "Okay.",
  "Uh Travis Kelce at 10.",
  "So, we just picked a different rookie tight end together.",
  "Mark Andrews at 11.",
  "And I have Dolan Concade at 12.",
  "Makes sense.",
  "Yeah.",
  "So, wait, who' you say was 11?",
  "Uh Mark Andrews.",
  "Okay.",
  "So, obviously all our outliers, Matt, Zack Z, go ahead.",
  "You want to talk about Zack Z real quick?",
  "I mean, I we we basically touched on it.",
  "I just I I I think this is a great offense.",
  "Obviously, year two with um Jaden Daniels, I think the whole offense is going to be better and humming and obviously they they got uh Terry in which is I think great news just for this whole kind of thing going on and you know they're they're they brought in Z I think as a guy that they felt familiar with and they drafted Sonat last year.",
  "really hasn't come together for Ben um yet and had a rough camper I heard rather yeah even even in camp hasn't been great so I think that's going to make them kind of rely on Z even more John Bates is a fine tight end he's just not going to be a factor in the pass catching realm and Z had a really good kick right and Z has looked great so um I think you know last year he was at tight end seven and this is actually a step back you know what I mean getting him in at tight end 11 just because I think there is going to be some sort of negative effect with with Debo being there I just don't think it's I think it can be offset by things like like like touchdowns.",
  "Um so I don't think he's going to get to the 91 targets that he had last year, but it was 91 targets, 66 receptions, so he could be more efficient with less targets and still kind of be in that same catch range.",
  "And you know, maybe maybe a slight drop off in in um uh yardage, but from what I had reports on camp is like they really were utilizing ZS a ton in the red zone.",
  "And and everything I read like he was just dominating every rep in there.",
  "So he's a very savvy tight end.",
  "Obviously going to be one of the older tight end producers that we've ever seen.",
  "If he does do that, I think it's 35. 35 or 36. 34.",
  "Okay.",
  "Okay.",
  "So he's going to be 35.",
  "So Garrett, who was your outlier?",
  "My weird one was uh Hunter Henry.",
  "Hunter Henry.",
  "Uh here here's the biggest reason.",
  "total targets at the tight end position.",
  "He was fifth last year, fifth in targets.",
  "If he's going to be getting that kind of volume in this offense, which it could maybe trickle down a little bit.",
  "Uh we do have Stefon Diggs there.",
  "We we do have Kyle Williams there now.",
  "So, it could drop a little bit, but I don't think it's going to drop significantly.",
  "I still think he's going to be inside the top eight or so at on targets.",
  "And I think they're going to be better targets this year.",
  "and and Hunter Henry even missed the game.",
  "So, it wasn't even like he he played every game.",
  "Uh but he was still there.",
  "97 targets last year for Hunter Henry.",
  "Very very solid number.",
  "And he's just the most unsexy guy to do it.",
  "But if if something goes wonky in my my reddraft leagues or even in my dynasty leagues and I just don't have a tight end, he's the easy like break glass in case of emergency guy because I know he's going to get me eight to nine points a game and twothirds probably get it done.",
  "You know, if not a third, a third and fourth would get done for Henry.",
  "And and you're right, like I He's another guy I really want to get in.",
  "And you're right, man.",
  "It got real wonky to back here because there's so many guys I wanted to get in, right?",
  "I I found a path for John Smith with paired back up with Arthur Smith to be the clear number two option in Pittsburgh.",
  "I think there's a chance for him to be Ferguson.",
  "I'm spread knowing how to hit him.",
  "Jake Ferguson has a chance like all those guys are all sitting there.",
  "Hunter Henry, I was like, dude, a very clear path for him to be the number two target there.",
  "Zack Z was another guy getting in there.",
  "I settle Dan Concade.",
  "I think it's pretty clear and obvious this is a player, former first round pick, enters year three year.",
  "This is going to be his make or break year.",
  "This is by all reports even out of like outside of the scout I talked to saying hey they want to make sure this offense is run through like don't look conc just comes down to can he stay healthy can he get separation for me and for me I think coming in this offense that's going to be you know a dominant offense out there they have no clear cut wide receiver one on this offense",
  "yes it's because they paid clear Shakir they didn't even pay him wide receiver one number they paid him wide receiver two to money and that's what Cleo Shakare really wins.",
  "So like does Keon Coleman step up in as the number one weapon in this offense or is it Dinc Concaid?",
  "I'm gonna put my money on Daltton Concaid in that manner and because if it is Khalil Shakir then we're just looking at lackluster passing game as it is as they spread around.",
  "I think for me even though he's tight end 26 last year um I think he has a chance to slide into that number one target role.",
  "So yes, am I being biased here?",
  "Am I speaking out of love?",
  "Yes.",
  "And I'm gonna stick with my evaluation that I saw on tape.",
  "And, you know, I knew this was a player that, you know, had a chance to take some time.",
  "This is a guy who didn't really play football at all in high school.",
  "Like, he moved out, then he played Jo, went up to Utah, and then he was in the NFL.",
  "Like, he only has like going to this year, he's honestly, he's only been playing football for like six years.",
  "So, for me, having that draft pedigree, them want to prove that they're right in their in their assumption on him.",
  "I think he has a chance to take a step forward.",
  "Um hopefully it's higher than 12, but like I feel like this is the range he could possibly live in.",
  "I think there's a lot of upside there.",
  "Uh but right now I'm going to be a little uh bearish on him even though I love him.",
  "So he's my outlier.",
  "I think everything else like we all had Mark Andrews in there.",
  "I think the only one that I didn't hear you guys say that I did have was Kyle Pitts.",
  "Did you Nobody had Kyle Pitts in there?",
  "I did not have.",
  "So yeah.",
  "So this is maybe not quite the same love, but Kyle Pittz is a player that Yes.",
  "He's been severely severely disappointing uh over over the course of the past three seasons, but we have a we have a new new sheriff in town.",
  "We got a new quarterback in here.",
  "Um granted, it's what they should say, but all signs point to them saying like, \"No, we must get Kyle Pittz the football.\"",
  "Like, this is this is a must.",
  "He's the number two option in this offense.",
  "I mean, it is it's Drake London to be Well, right.",
  "I'm sorry.",
  "besides Bejan, who is actually the number two.",
  "Um, but like down like a downfield, but young guys tend to not check it down as much.",
  "They tend to take more chances downfield.",
  "I I'll tell you this.",
  "I have no idea.",
  "I would say there's almost a 0% chance, which is low.",
  "Did they pick up his fifth year option?",
  "Oh, they're not picking that option.",
  "Yeah, because where he was drafted, it's too much money.",
  "Didn't they already have to make that decision?",
  "Did they get open to Google?",
  "get up on the Google because after year three they have to make that decision.",
  "Oh, really?",
  "If they did, that's crazy because he was a top 10 pick, so they had to pay him top 10 pick fifth year option money, which is crazy on production.",
  "Yeah, I mean obviously he's besides his rookie year hasn't done anything that would indicate that you want the Atlanta Falcons picked up Kyle Pitt's fifth year contract option on April 29th.",
  "There's almost a 0% chance.",
  "Rich, there's a 0% chance already did it.",
  "So, that's how my mind works.",
  "I speak in facts.",
  "Uh I listen I'm like Matt just said besides Rick Gear he has done nothing.",
  "So as much as like he's only 25 he 100% can be be an alltime great tight end.",
  "Like no that remember that one wonky couple years he had those three years there uh in Atlanta.",
  "That one wonky threeear window.",
  "For what it's worth this is his fifth year.",
  "So this is his final year.",
  "Oh this is his fifth year.",
  "Oh yeah god.",
  "Time flies when you're talking dynasty.",
  "Um, well, it really does.",
  "It's insane.",
  "Isn't that crazy that it's already year five?",
  "So, he had the one great rookie season and then three duds.",
  "Yeah.",
  "So, for me, it's Arthur Smith, Arthur Smith, who whoever the heck's there now, I guess.",
  "I can't remember the cousin.",
  "Who's the who's the OC there now?",
  "Uh, some former Rams guy.",
  "Okay.",
  "There's so many all the like when we talk about all those bunch of guys in the bottom there like a guy in Zachary, it's Hunter Henry.",
  "I feel more comfortable about all them than Kyle Pittz.",
  "Like I just I'm I'm done until I see it and I don't believe it.",
  "Yeah, it's hard.",
  "But I'm not saying it's not in the realm of pass possibility.",
  "He's still again he's so young and he was so talent and he already did it at such a high level.",
  "He did in college at a high level so it's in there but something went sideways and it hasn't wr itself since his rookie year and you get to a certain point where like I don't know if it's even correctable.",
  "Now to be fair we saw a guy in the same exact mold, right?",
  "guy",
  "we already talked about, Ev",
  ".",
  "Evan Ingram came out, same gang busters.",
  "Same exact thing.",
  "Same exact thing and then fell off the face of the for the New York Giants.",
  "A first round pick, was amazing his year one, and then fell off the face until he got catch for two or three years.",
  "And for what it's worth, he was tight end 15 last year.",
  "So, it's not like he was crazy far away from the top 12, but it's still disappointing with where we expected and the value.",
  "Yeah.",
  "compared to ADP.",
  "And it's the thing what Kyle Pitts cost you compared to what you give Hunter Henry for.",
  "It's like or Zack Z, you know what I mean?",
  "It's like Exactly.",
  "And once you're in that range, like what am I paying?",
  "And like if you still have Kyle Pittz, you're not definitely you'd rather just hope and hold on and go down with the ship, right?",
  "Like I might take a second, honestly.",
  "I don't think I would.",
  "I think even though I'm the one like like proponent of him and I'm down on him, but I would still rather just like the the tight",
  "that",
  "position",
  "'s so elusive.",
  "and he's still so young.",
  "I would rather just gamble on the upside and like and then hope that like he doesn't work out in like Atlanta and he goes somewhere else and like just like Evan Ingram it was great, right?",
  "And he has so much time like dude he could be a dud for two more years and be as year 27 still have three or four guys.",
  "We've been wanting a guy to go here forever.",
  "What if he's finally the guy that joins Justin Herbert?",
  "Oh dude.",
  "Yeah.",
  "There.",
  "Or replaces Travis Kelce.",
  "You know what I mean?",
  "Solomon knows.",
  "I thought that's what you were going to say.",
  "We've been trying to play for years forever.",
  "Mike Casei, it's happening.",
  "No, dude.",
  "What?",
  "I was Yeah, what if he did get extended in Cincinnati though?",
  "He did.",
  "God bless.",
  "Hey, Nerd Herd.",
  "Want to tell you about a  show that we've been doing live on YouTube where we go over your teams and we talk about how to fix your broken roster.",
  "It's called Roster Rescue.",
  "We do it live every single Monday at noon Eastern time.",
  "And if you want to get a part of that, just head to our Dynasty Nerds homepage, go under the store tab, and you'll find roster rescue right there.",
  "Perfect opportunity to get your rosters in shape before the season or even in the middle of the season to make sure that you can win a championship.",
  "Mark Andrew's on our list.",
  "You know,  somebody who's taking a big dump down is it really had to do with likely news.",
  "Sure.",
  "Uh Harbaugh saying, \"Hey, we expect him to be like an allp pro.\"",
  "All signs that like literally they were trying to extend him.",
  "They get hurt real bad.",
  "Despite all that and despite that, Mark Andrews fell off like real hard early in the game.",
  "I think the first",
  "Now, you remember he he did have that pre uh season car accident.",
  "So, he was hurt going to the season.",
  "Uh well, he didn't really start coming on until I think it was like week five or six.",
  "Mark Andrews finished as tight end six overall last year.",
  "Like, he was still a very solid.",
  "All the dude does is produce, man.",
  "Yeah.",
  "So, I mean, we we all have them pretty low, right?",
  "I have him at 10.",
  "You had him where?",
  "I had him at 10.",
  "At 10 of them, exactly the 10.",
  "Yeah.",
  "And and last year if you you know he started the year so bad but from week five on he was tied in five like he he was he was really good and only a couple he only had two games under 10 points during that stretch too.",
  "So he was still fairly consistent but yeah he's he's a tough one because you feel like the other shoe is about to drop any time but it just hasn't and he's still he's still putting up numbers.",
  "All right let's talk two rookies then we'll finish it off with Tucker Craft talk.",
  "Sounds good.",
  "Okay.",
  "So, Matt, you have Coloulston Lovelin in at number nine.",
  "Eight.",
  "Eight.",
  "And I have Tyler Warren at nine.",
  "So, um I was telling Garrett on the uh fantasy roster rescue show like God, why is this KD thing off?",
  "And then he looked it up.",
  "He's like, \"Whoa, Matt's got Coloulston Lovelin so high.",
  "I think you have like 35th overall in Superflex Titan Premium Rinkets.\"",
  "I I I think that's something I just need to go in and correct and back.",
  "I think it's a a function of the way we copy and paste or copy over.",
  "I got I think it's just That makes sense.",
  "Okay.",
  "fix that.",
  "I will.",
  "I think I I think I",
  "So, he's not a top three round pick for you.",
  "No, I have to move him down specifically every single time.",
  "And I think I forgot I had to move I have to I have to go back in and move Brock Bowers down because when I don't it automatically moves him to my number one overall player.",
  "So, and I and it was just it was a it must have been like I I did an update, I forgot to just move him.",
  "Gotcha.",
  "Gotcha.",
  "That makes sense.",
  "So, you but you still haven't finished as tight end eight amongst such a crowded room of weapons here.",
  "DJ Moore, uh, Romo Dunay, the the staff has been raving about Luther Burton over the last two weeks.",
  "So, how does how does Colston Lovelin carve out a path in a 2025 season as a rookie tight end?",
  "Yeah.",
  "Yeah.",
  "I think, uh, you know, obviously this is a very crowded situation.",
  "Um, so that's going to be I think the biggest hurdle is to to get over is is to get the targets, but we've seen obviously rookies make a big impact in Ben Johnson's offense in the past.",
  "Sam Leaporta comes directly to mind his rookie year when he finished as I think tight end two or three.",
  "Um I can't remember it was he was tight end one at one point and I think I think he got passed in that year.",
  "Um so I'm not I'm not bl bumping him up that crazy high",
  "but",
  "this past he was actually tight end one but it was partly because a few guys missed a couple games and he didn't.",
  "So on a points per game basis he was tight end three overall.",
  "I knew there was something weird.",
  "He was he was up there really really high.",
  "Um obviously I think those numbers are going to be going to be hard to get to because there's just too many people to kind of target um in that offense, but we've we know they like to use them and I think they tipped their hand a little bit in that one preseason game.",
  "um when they got they got the ball in Kosen Levenson's hand on a quick easy pass right away and then another one you know a few plays later right down the seam and you know how do you make things easy on your quarterback is is give him predetermined quick easy reads that he can you know hit that back foot and and let it rip and Caleb we talked about it Caleb Williams actually looked good doing that we weren't sure if he was able to if he was going to be able to play within the confines of like a structured offense like that and he looked good doing it.",
  "And I think the way you kind of do that is make give him short, quick, easy passes and get him in a rhythm early.",
  "And I think they're going to try to establish that kind of offense pretty much throughout the entire year.",
  "And that that kind of stuff breeds, I think, or it lends itself to getting the tight ends specifically involved quickly and early.",
  "And I think that's kind of gonna kind of snowball into Coulson Lovelin getting a lot of targets and then getting a lot of confidence.",
  "And once you have that kind of stuff established and the kind of chemistry established with the quarterback, hey, I know you're going to be here when when you're supposed to be and I can let it rip and you're going to make that catch and get me yards after the catch, which is something Coulson Lovelin is very good at.",
  "I think I think it's going to be kind of a glove inhand fit with with Coulson Lovelin, the young quarterback, and this offense.",
  "I kind of felt that way about Tyler Warren.",
  "We saw him, he's coming out of Penn State.",
  "We said when scouting him, he's probably the most pro ready tight end that we saw that probably had like I think we talked about like it wouldn't surprise us if Tyler Warren had the most productive year one, but if it wouldn't surprise us also if Coulson Leland had a better long-term career.",
  "Um coming off a year at Penn State where he had 104 catches uh for over,200 yards out there.",
  "All reports that I've seen so far coming out of Indianapolis is that this coaching staff has been working on getting Tyler Warren involved in offense early and often.",
  "So with those reports saying like we said, I like Josh DS a ton.",
  "I like uh Michael Pitman as well.",
  "This is offense.",
  "I think they're going to want to keep the ball everything short and sweet.",
  "Help Daniel Jones out on his roll out who's the athletic tight end.",
  "And I think they're going to find ways to make sure that he's either the first or second look in this offense.",
  "So, for me, I think Tyler Warren, just because of target share alone, how many catches he's going to get this year, is going to finish as a tight end one.",
  "Uh, a lot of guys you could switch him out for, but I want to sneak one.",
  "I I I felt good enough about him for how how much production he's going to see.",
  "Same.",
  "You know what I And like that's like like I felt good enough about it that I was like so I I didn't get any rookies in there, but do you want to know who I actually have projected as the highest rookie tight end?",
  "Mason Taylor.",
  "Mason Taylor.",
  "Mason Taylor.",
  "I mean, I can see that, too.",
  "Yeah, no doubt.",
  "Nobody there to catch the football outside of Garrett Wilson.",
  "Wilson and him.",
  "Baron.",
  "Yes.",
  "Yeah.",
  "A ton.",
  "And then um so it leaves us with Tucker Craft.",
  "Uh I had him an eight.",
  "Matt, you had him at nine.",
  "And Garrett, you had him at nine.",
  "So we're all pretty close.",
  "somebody who finished tight end eight last year.",
  "But when you look at something, what's really interesting here when you look at him is amongst all tight ends, he led the led all tight ends in yards after contact and broken tackles.",
  "I could see him finishing so much higher if there wasn't such a mess at the wide.",
  "Like so many wide receivers, so many people get the ball, so many people to target and they spread it around so much that it's hard for me to bump him higher than I got him.",
  "And and I go back to that we we we mentioned it when he said it, Matt Lafleur, like this is a month or so ago.",
  "He said, you know, he said, \"If there's an area we got to do better at, it's featuring the tight end.\"",
  "And we saw last year that this offense targeted the tight ends 25% of the time.",
  "Um, when you have somebody who in her first year as being the main guy there excel uh with the ball in his hands like Tucker Craft did, I see why he would say something like that with such a poperri of mystery at the receiver position.",
  "It's kind of playing out.",
  "I think in the end it could be somebody like Tucker Craft is the most valuable receiving weapon we see in that offense.",
  "So, I think we're all like pretty comfortable because he finished the tight end eight last year.",
  "No reason not to do that.",
  "Yep.",
  "But he's the kind of guy like I said, right?",
  "I ended at eight for Doug Craft for a reason because that was the last guy I saw that could propel up to like as high as five and it wouldn't shock me in the least.",
  "Yeah, he's super talented, man.",
  "And and you know, given, you know, that some of these guys, you know, George KD's a little bit older.",
  "Evan Ingram's a little bit older.",
  "Travis Kelce obviously a little bit older.",
  "He's a guy that we're going to be having to have the conversation, you know, is he this next guy that's going to be able to get a tier if if Green Bay's wide receivers kind of start to dissipate in the next couple of seasons or even just solidify who's who and well, what's what's the roles there?",
  "I I mentioned it when we were doing all the division breakdowns.",
  "They have a lot of guys that are coming up on contract years.",
  "So, they it's not going to be the same thing in two years in Green Bay than it is right now.",
  "So, I I think I think there's going to be a conversation, you know, about Tucker Craft.",
  "Is he is he talented enough to be a top four guy in a couple of seasons?",
  "So, this might be a nice opportunity while he's kind of had has a little bit of a depressed um value to kind of go out and say, \"Hey, let's let's make some moves for Tuckercraft now because in two or three years, he's going to be a guy that's kind of up in this other echelon um nipping at at heels of the top tier.\"",
  "He is a great That's a really good point from a D perspective.",
  "He's probably one of the best high upside buys at the position.",
  "Yeah, absolutely.",
  "Yeah, and I don't I don't have much to add on Tucker Craft.",
  "I echo what you guys say.",
  "I think he's a good player that's in a little bit of a messy situation, but the talent overrides that for me, and so I'm willing any guy in this range is a risk, but he's a guy that I'm willing to take the risk on.",
  "All right.",
  "So, as we get ready for next week is NFL football and we are going to do what we always do before season and bring you two episodes of our bold predictions for the 2025 season.",
  "We like to get We like to really just put ourselves out there, right?",
  "Like just, you know, do we think these are 100% be true?",
  "I like to sit back.",
  "I like to sit back and listen to Rich put himself out there.",
  "That's what I My goal My goal this year is to find one bold prediction for every single team.",
  "Oh my gosh.",
  "Is one of 32 bold predictions.",
  "So I mean usually the show we don't even have to talk then I will just sit there.",
  "No no because at the shows then I usually just like I'll ram through like real quick.",
  "I don't give an analyst why because like a lot of times just like analyst I was going to let that slide.",
  "It's an analyst.",
  "I'm an analyst.",
  "I was I was going to let you wipe that dirt.",
  "That sounds like a like a Saturday Night Live sketch like and he's the analyst.",
  "I like the way you said that.",
  "I got tingles.",
  "That was like a Jeopardy thing.",
  "He reads it wrong to Sean.",
  "Sean Connor analyst.",
  "Can I have the butt experts, please?",
  "Uh, that's analyst Sean.",
  "Ah, shut up, Tbec.",
  "So, we're back next week with those.",
  "If you enjoyed um our summer talk, uh, please leave a rain review wherever you find us.",
  "Uh, we appreciate it.",
  "Helps the show.",
  "So, if you take the time, uh, leave us a ring review on the show, subscribe on YouTube, follow us everywhere else.",
  "you get your social media.",
  "Uh, and we'll see you next week for kickoff of the NFL season.",
  "And the points start to count.",
  "Points per reception, yards, touchdowns, all of that as we brace ourselves for all the injuries as well.",
  "The real fun.",
  "The real fun.",
  "All the work is leading up to this.",
  "We'll be back next week with more Dynasty Fantasy football.",
  "Adios."
]